---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LandingNotEnoughBoundaryCurves
source: html/c3bcc614-9604-dd76-e672-9a56c42e4963.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LandingNotEnoughBoundaryCurves Property

Sketch landing require boundaries

## Syntax (C#)
```csharp
public static FailureDefinitionId LandingNotEnoughBoundaryCurves { get; }
```